Infineon/micropython/ports/psoc6/modbluetooth.c
    return wiced_result;
}


// ============================================================================
int mp_bluetooth_init(void) {
    wiced_result_t wiced_result;
    // Initialize the Bluetooth hardware and stack.

    if (mp_bluetooth_ble_stack_state == MP_BLUETOOTH_BLE_STATE_ACTIVE) {
        return 0;
    }

    mp_bluetooth_ble_stack_state = MP_BLUETOOTH_BLE_STATE_STARTING;

    /* Configure platform specific settings for the BT device */
    cybt_platform_config_init(&cybsp_bt_platform_cfg);

    /* Register call back and configuration with stack */
    wiced_result = wiced_bt_stack_init(bt_management_callback, &wiced_bt_cfg_settings);
    bluetooth_assert_raise_val("Bluetooth Stack Initialization failed with error: ", wiced_result, WICED_BT_SUCCESS);
    if (WICED_BT_SUCCESS != wiced_result) {
        mp_bluetooth_ble_stack_state = MP_BLUETOOTH_BLE_STATE_STOPPING;
        return 0;
    }
    mp_bluetooth_ble_stack_state = MP_BLUETOOTH_BLE_STATE_ACTIVE;
    return 0;
}

int mp_bluetooth_deinit() {
    if (mp_bluetooth_ble_stack_state == MP_BLUETOOTH_BLE_STATE_OFF) {
        return 0;
    }
    // wiced_bt_gatt_disconnect(conn_id) //ToDo in GATT API's
    wiced_bt_stack_deinit();
    mp_bluetooth_ble_stack_state = MP_BLUETOOTH_BLE_STATE_OFF;
    return 0;
}

// Returns true when the Bluetooth stack is active.
bool mp_bluetooth_is_active(void) {
    return mp_bluetooth_ble_stack_state == MP_BLUETOOTH_BLE_STATE_ACTIVE;
}

// Gets the current address of this device in big-endian format.
void mp_bluetooth_get_current_address(uint8_t *addr_type, uint8_t *addr) {
    // wiced_bt_device_address_t bda = { 0 };
    if (!mp_bluetooth_is_active()) {
        mp_raise_OSError(ERRNO_BLUETOOTH_NOT_ACTIVE);
    }
    switch (address_mode) {
        case BLE_ADDR_PUBLIC:
            *addr_type = BLE_ADDR_PUBLIC;
            break;
        case BLE_ADDR_RANDOM:
            *addr_type = BLE_ADDR_RANDOM;
            break;
        default:
            mp_raise_OSError(MP_EINVAL);
    }

    wiced_bt_dev_read_local_addr(addr);
}

static void generate_random_address(wiced_bt_device_address_t addr) {
    cyhal_trng_t trng_obj;
    uint32_t random_data[2];
    cy_rslt_t rslt = cyhal_trng_init(&trng_obj);
    if (rslt != CY_RSLT_SUCCESS) {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("TRNG init failed!\n"));
    }
    random_data[0] = cyhal_trng_generate(&trng_obj);
    random_data[1] = cyhal_trng_generate(&trng_obj);
    memcpy(addr, random_data, 6);
    cyhal_trng_free(&trng_obj);
}

// Sets the addressing mode to use.Alongwith it already sets the address as well based on mode selected
void mp_bluetooth_set_address_mode(uint8_t addr_mode) {
    wiced_bt_device_address_t addr;
    if (!mp_bluetooth_is_active()) {
        mp_raise_OSError(ERRNO_BLUETOOTH_NOT_ACTIVE);
    }
    switch (addr_mode) {
        case MP_BLUETOOTH_ADDRESS_MODE_PUBLIC: {
            address_mode = BLE_ADDR_PUBLIC;
            for (int i = 0; i < 5; i++) {
                addr[i] = *(cy_bt_device_address + i);
            }
            break;
        }
        case MP_BLUETOOTH_ADDRESS_MODE_RANDOM: {
            address_mode = BLE_ADDR_RANDOM;
            generate_random_address(addr);
            addr[5] = (addr[5] & 0x3F) | 0xC0; // MSB[0:1] - 11 - Static Random Address
            break;
        }
        // ToDo: This is in a way supported from MTB BLE stack side but is complicated to map to MPY side. Requires NVRAM to store the keys. Considering this is not an absolutely necessary feature, let's postpone for extension after MVP?
        case MP_BLUETOOTH_ADDRESS_MODE_RPA:
        case MP_BLUETOOTH_ADDRESS_MODE_NRPA:
            // Not yet supported.
            mp_raise_OSError(MP_EINVAL);
            break;
    }
    wiced_result_t wiced_result = wiced_bt_set_local_bdaddr(addr, address_mode);
    if (WICED_BT_SUCCESS != wiced_result) {
        mp_printf(&mp_plat_print, "Device address setting failed!\n");
    }
}

// Get or set the GAP device name that will be used by service 0x1800, characteristic 0x2a00.
size_t mp_bluetooth_gap_get_device_name(const uint8_t **buf) {
    *buf = (const uint8_t *)app_gap_device_name;
    return strlen((const char *)app_gap_device_name);
}

int mp_bluetooth_gap_set_device_name(const uint8_t *buf, size_t len) {
    mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Feature unsupported: Device name cannot be set in run-time for this port.\n"));
    return MP_EOPNOTSUPP;
}

int mp_bluetooth_gap_advertise_start(bool connectable, int32_t interval_us,
    const uint8_t *adv_data, size_t adv_data_len,
    const uint8_t *sr_data, size_t sr_data_len) {

    if (!mp_bluetooth_is_active()) {
        return ERRNO_BLUETOOTH_NOT_ACTIVE;
    }

    wiced_result_t result = WICED_BT_SUCCESS;
    // Static storage for last used adv/scanned data
    static wiced_bt_ble_advert_elem_t *last_adv_elements = NULL;
    static uint8_t last_num_adv_elements = 0;
    static wiced_bt_ble_advert_elem_t *last_sr_elements = NULL;
    static uint8_t last_num_sr_elements = 0;

    // Stop advertising if interval_us is 0 or None
    if (interval_us == 0) {
        stop_advertisement();
        return 0;
    } else {
        mp_printf(&mp_plat_print, "Advertising interval is ignored and set to default interval internally - 0x0020 to 0x4000\r\n");
    }

    // Handle adv_data
    if (adv_data == NULL) {
        // Reuse previous
        adv_data = NULL;
        adv_data_len = 0;
    }
    if (adv_data_len == 0 && last_adv_elements) {
        // Clear previous
        free_advert_elements(last_adv_elements, last_num_adv_elements);
        last_adv_elements = NULL;
        last_num_adv_elements = 0;
    }
    if (adv_data && adv_data_len > 0) {
        if (last_adv_elements) {
            free_advert_elements(last_adv_elements, last_num_adv_elements);
        }
        result = parse_ltv_to_advert_elements(adv_data, adv_data_len, &last_adv_elements, &last_num_adv_elements);
        if (result != WICED_SUCCESS) {
            return result;
        }
    }

