Infineon/micropython/ports/psoc6/modbluetooth.c
    // Handle scan response data
    if (sr_data == NULL) {
        sr_data = NULL;
        sr_data_len = 0;
    }
    if (sr_data_len == 0 && last_sr_elements) {
        free_advert_elements(last_sr_elements, last_num_sr_elements);
        last_sr_elements = NULL;
        last_num_sr_elements = 0;
    }
    if (sr_data && sr_data_len > 0) {
        if (last_sr_elements) {
            free_advert_elements(last_sr_elements, last_num_sr_elements);
        }
        result = parse_ltv_to_advert_elements(sr_data, sr_data_len, &last_sr_elements, &last_num_sr_elements);
        if (result != WICED_SUCCESS) {
            return result;
        }
    }

    // Set advertisement data
    result = wiced_bt_ble_set_raw_advertisement_data(last_num_adv_elements, last_adv_elements);
    if (result != WICED_SUCCESS) {
        return result;
    }

    if (sr_data && sr_data_len > 0) {
        result = wiced_bt_ble_set_raw_scan_response_data(last_num_sr_elements, last_sr_elements);
        if (result != WICED_SUCCESS) {
            return result;
        }
    }

    // Start advertising
    result = wiced_bt_start_advertisements(BTM_BLE_ADVERT_UNDIRECTED_HIGH, BLE_ADDR_PUBLIC, NULL);

    return result;
}


// Stop advertisement. No-op when already stopped.
void mp_bluetooth_gap_advertise_stop(void) {
    wiced_result_t wiced_status;
    if (!mp_bluetooth_is_active()) {
        return;
    }
    wiced_status = wiced_bt_start_advertisements(BTM_BLE_ADVERT_OFF, 0, NULL);
    bluetooth_assert_raise_val("Stopping Bluetooth LE advertisements failed with error: ", wiced_status, WICED_SUCCESS);
    return;
}

#if MICROPY_PY_BLUETOOTH_ENABLE_CENTRAL_MODE

int mp_bluetooth_gap_scan_start(int32_t duration_ms, int32_t interval_us, int32_t window_us, bool active_scan) {
    return 0;
}

// Stop discovery
int mp_bluetooth_gap_scan_stop(void) {
    return 0;
}

// Connect to a found peripheral.
int mp_bluetooth_gap_peripheral_connect(uint8_t addr_type, const uint8_t *addr, int32_t duration_ms, int32_t min_conn_interval_us, int32_t max_conn_interval_us) {
    // ret_status = wiced_bt_gatt_le_connect( p_scan_result->remote_bd_addr, p_scan_result->ble_addr_type, BLE_CONN_MODE_LOW_DUTY, TRUE );
    // printf( "wiced_bt_gatt_connect status %d\r\n", ret_status );
    return 0;
}

// Cancel in-progress connection to a peripheral.
int mp_bluetooth_gap_peripheral_connect_cancel(void) {
    return 0;
}

#endif // MICROPY_PY_BLUETOOTH_ENABLE_CENTRAL_MODE


// Start adding services. Must be called before mp_bluetooth_register_service.
int mp_bluetooth_gatts_register_service_begin(bool append) {
    return 0;
}
// Add a service with the given list of characteristics to the queue to be registered.
// The value_handles won't be valid until after mp_bluetooth_register_service_end is called.
int mp_bluetooth_gatts_register_service(mp_obj_bluetooth_uuid_t *service_uuid, mp_obj_bluetooth_uuid_t **characteristic_uuids, uint16_t *characteristic_flags, mp_obj_bluetooth_uuid_t **descriptor_uuids, uint16_t *descriptor_flags, uint8_t *num_descriptors, uint16_t *handles, size_t num_characteristics) {
    return 0;
}
// Register any queued services.
int mp_bluetooth_gatts_register_service_end(void) {
    return 0;
}

// Read the value from the local gatts db (likely this has been written by a central).
int mp_bluetooth_gatts_read(uint16_t value_handle, const uint8_t **value, size_t *value_len) {
    return 0;
}
// Write a value to the local gatts db (ready to be queried by a central). Optionally send notifications/indications.
int mp_bluetooth_gatts_write(uint16_t value_handle, const uint8_t *value, size_t value_len, bool send_update) {
    return 0;
}
// Send a notification/indication to the central, optionally with custom payload (otherwise the DB value is used).
int mp_bluetooth_gatts_notify_indicate(uint16_t conn_handle, uint16_t value_handle, int gatts_op, const uint8_t *value, size_t value_len) {
    return 0;
}

// Resize and enable/disable append-mode on a value.
// Append-mode means that remote writes will append and local reads will clear after reading.
int mp_bluetooth_gatts_set_buffer(uint16_t value_handle, size_t len, bool append) {
    return 0;
}

#if MICROPY_PY_BLUETOOTH_ENABLE_GATT_CLIENT

// Find all primary services on the connected peripheral.
int mp_bluetooth_gattc_discover_primary_services(uint16_t conn_handle, const mp_obj_bluetooth_uuid_t *uuid) {
    return 0;
}
// Find all characteristics on the specified service on a connected peripheral.
int mp_bluetooth_gattc_discover_characteristics(uint16_t conn_handle, uint16_t start_handle, uint16_t end_handle, const mp_obj_bluetooth_uuid_t *uuid) {
    return 0;
}
// Find all descriptors on the specified characteristic on a connected peripheral.
int mp_bluetooth_gattc_discover_descriptors(uint16_t conn_handle, uint16_t start_handle, uint16_t end_handle) {
    return 0;
}
// Initiate read of a value from the remote peripheral.
int mp_bluetooth_gattc_read(uint16_t conn_handle, uint16_t value_handle) {
    return 0;
}

// Write the value to the remote peripheral.
int mp_bluetooth_gattc_write(uint16_t conn_handle, uint16_t value_handle, const uint8_t *value, size_t value_len, unsigned int mode) {
    return 0;
}
// Initiate MTU exchange for a specific connection using the preferred MTU.
int mp_bluetooth_gattc_exchange_mtu(uint16_t conn_handle) {
    return 0;
}
#endif // MICROPY_PY_BLUETOOTH_ENABLE_GATT_CLIENT

// Disconnect from a central or peripheral.
int mp_bluetooth_gap_disconnect(uint16_t conn_handle) {
    return 0;
}

// Set/get the MTU that we will respond to a MTU exchange with.
// ToDo: wiced_bt_l2cap_le_get_peer_mtu gets the peer mtu but needs L2CAP connection established. Handle in L2CAP enablement // Default size is GATT_BLE_DEFAULT_MTU_SIZE : 23
int mp_bluetooth_get_preferred_mtu(void) {
    return GATT_BLE_DEFAULT_MTU_SIZE;
}

// ToDo: wiced_bt_gatt_client_configure_mtu allows configuring mtu size but needs GATT connection handle. Handle in GATT enablement.
int mp_bluetooth_set_preferred_mtu(uint16_t mtu) {
    if (!mp_bluetooth_is_active()) {
        return ERRNO_BLUETOOTH_NOT_ACTIVE;
    }
    return MP_EOPNOTSUPP;
}
#endif
